lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
inline bool bleCsBuildLlControlReqRsp(uint8_t opcode,
                                      uint8_t configId,
                                      bool accessAddressReuse,
                                      BleCsLlControlPdu* outPdu) {
  if (opcode != kBleCsLlCtrlReq && opcode != kBleCsLlCtrlRsp) {
    return false;
  }
  if (!bleCsLlControlInitPdu(opcode, kBleCsLlControlReqRspPayloadLength,
                             kBleCsLlControlReqRspPduLength, outPdu)) {
    return false;
  }
  outPdu->bytes[2] = accessAddressReuse ? 1U : 0U;
  outPdu->bytes[3] = configId;
  return true;
}

inline bool bleCsBuildLlControlReq(uint8_t configId,
                                   bool accessAddressReuse,
                                   BleCsLlControlPdu* outPdu) {
  return bleCsBuildLlControlReqRsp(kBleCsLlCtrlReq, configId,
                                   accessAddressReuse, outPdu);
}

inline bool bleCsBuildLlControlRsp(uint8_t configId,
                                   bool accessAddressReuse,
                                   BleCsLlControlPdu* outPdu) {
  return bleCsBuildLlControlReqRsp(kBleCsLlCtrlRsp, configId,
                                   accessAddressReuse, outPdu);
}

inline bool bleCsBuildLlControlConfig(
    const BleCsLlControlConfigParams& params,
    BleCsLlControlPdu* outPdu) {
  if (!bleCsLlControlInitPdu(kBleCsLlCtrlCfg, kBleCsLlControlCfgPayloadLength,
                             kBleCsLlControlCfgPduLength, outPdu)) {
    return false;
  }
  outPdu->bytes[2] = params.configId;
  memcpy(&outPdu->bytes[3], params.params, sizeof(params.params));
  return true;
}

inline bool bleCsBuildLlControlSecurityReqRsp(uint8_t opcode,
                                              uint8_t configId,
                                              BleCsLlControlPdu* outPdu) {
  if (opcode != kBleCsLlCtrlSecReq && opcode != kBleCsLlCtrlSecRsp) {
    return false;
  }
  if (!bleCsLlControlInitPdu(opcode, kBleCsLlControlSecurityPayloadLength,
                             kBleCsLlControlSecurityPduLength, outPdu)) {
    return false;
  }
  outPdu->bytes[2] = configId;
  return true;
}

inline bool bleCsBuildLlControlSecurityReq(uint8_t configId,
                                           BleCsLlControlPdu* outPdu) {
  return bleCsBuildLlControlSecurityReqRsp(kBleCsLlCtrlSecReq, configId,
                                           outPdu);
}

inline bool bleCsBuildLlControlSecurityRsp(uint8_t configId,
                                           BleCsLlControlPdu* outPdu) {
  return bleCsBuildLlControlSecurityReqRsp(kBleCsLlCtrlSecRsp, configId,
                                           outPdu);
}

inline bool bleCsBuildLlControlProcedureReqRsp(
    uint8_t opcode,
    const BleCsLlControlProcedureParams& params,
    BleCsLlControlPdu* outPdu) {
  if (opcode != kBleCsLlCtrlProcReq && opcode != kBleCsLlCtrlProcRsp) {
    return false;
  }
  if (!bleCsLlControlInitPdu(opcode, kBleCsLlControlProcedurePayloadLength,
                             kBleCsLlControlProcedurePduLength, outPdu)) {
    return false;
  }
  outPdu->bytes[2] = params.configId;
  bleCsLlWriteLe16(&outPdu->bytes[3], params.maxProcedureLen);
  bleCsLlWriteLe16(&outPdu->bytes[5], params.minProcedureInterval);
  bleCsLlWriteLe16(&outPdu->bytes[7], params.maxProcedureInterval);
  bleCsLlWriteLe16(&outPdu->bytes[9], params.maxProcedureCount);
  bleCsLlWriteLe32(&outPdu->bytes[11], params.minSubeventLen);
  bleCsLlWriteLe32(&outPdu->bytes[15], params.maxSubeventLen);
  outPdu->bytes[19] = params.phy;
  outPdu->bytes[20] = static_cast<uint8_t>(params.txPowerDelta);
  return true;
}

inline bool bleCsBuildLlControlProcedureReq(
    const BleCsLlControlProcedureParams& params,
    BleCsLlControlPdu* outPdu) {
  return bleCsBuildLlControlProcedureReqRsp(kBleCsLlCtrlProcReq, params,
                                            outPdu);
}

inline bool bleCsBuildLlControlProcedureRsp(
    const BleCsLlControlProcedureParams& params,
    BleCsLlControlPdu* outPdu) {
  return bleCsBuildLlControlProcedureReqRsp(kBleCsLlCtrlProcRsp, params,
                                            outPdu);
}

inline bool bleCsBuildLlControlStart(
    const BleCsLlControlStartParams& params,
    BleCsLlControlPdu* outPdu) {
  if (!bleCsLlControlInitPdu(kBleCsLlCtrlStart,
                             kBleCsLlControlStartPayloadLength,
                             kBleCsLlControlStartPduLength, outPdu)) {
    return false;
  }
  outPdu->bytes[2] = params.configId;
  bleCsLlWriteLe16(&outPdu->bytes[3], params.subeventLen);
  bleCsLlWriteLe16(&outPdu->bytes[5], params.subeventInterval);
  bleCsLlWriteLe16(&outPdu->bytes[7], params.eventInterval);
  bleCsLlWriteLe16(&outPdu->bytes[9], params.procedureInterval);
  bleCsLlWriteLe16(&outPdu->bytes[11], params.procedureCount);
  outPdu->bytes[13] = params.reserved0;
  outPdu->bytes[14] = params.reserved1;
  outPdu->bytes[15] = params.reserved2;
  return true;
}

inline bool bleCsBuildLlControlTerminateAbort(uint8_t opcode,
                                              uint8_t reason,
                                              BleCsLlControlPdu* outPdu) {
  if (opcode != kBleCsLlCtrlTerminate && opcode != kBleCsLlCtrlAbort) {
    return false;
  }
  if (!bleCsLlControlInitPdu(opcode,
                             kBleCsLlControlTerminateAbortPayloadLength,
                             kBleCsLlControlTerminateAbortPduLength,
                             outPdu)) {
    return false;
  }
  outPdu->bytes[2] = reason;
  return true;
}

inline bool bleCsBuildLlControlTerminate(uint8_t reason,
                                         BleCsLlControlPdu* outPdu) {
  return bleCsBuildLlControlTerminateAbort(kBleCsLlCtrlTerminate, reason,
                                           outPdu);
}

inline bool bleCsBuildLlControlAbort(uint8_t reason,
                                     BleCsLlControlPdu* outPdu) {
  return bleCsBuildLlControlTerminateAbort(kBleCsLlCtrlAbort, reason, outPdu);
}

struct BleCsToneSample {
  bool valid = false;
  int8_t rssiDbm = 0;
  uint8_t cteTimeUnits = 0;
  uint8_t cteType = 0;
  int16_t i = 0;
  int16_t q = 0;
  uint16_t magnitude = 0;
  uint16_t magnitudeStd = 0;
  uint16_t phase = 0;
};

struct BleCsDfeCaptureInfo {
  bool present = false;
  bool allZero = true;
  uint16_t amountBytes = 0U;
  uint16_t currentAmountBytes = 0U;
};

struct BleCsIqSample {
  int16_t i = 0;
  int16_t q = 0;
};

struct BleCsSubeventStep {
  uint8_t mode = 0U;
  uint8_t channel = 0U;
  uint8_t dataLen = 0U;
  const uint8_t* data = nullptr;
};

struct BleCsStepMode1Data {
  uint8_t aaCheckQuality = kBleCsPacketQualityAaCheckNotFound;
  uint8_t bitErrors = 0x0FU;
  uint8_t nadm = 0xFFU;
  int8_t packetRssiDbm = 0;
  int16_t timeDifferenceHalfNs = kBleCsTimeDifferenceNotAvailable;
  uint8_t packetAntenna = 0U;
  bool hasRttSoundingSequence = false;
  BleCsIqSample soundingPct1{};
  BleCsIqSample soundingPct2{};
};

