lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
  // ─── Zephyr Parity: FAE Table HCI ──────────────────────────
  static bool buildHciReadRemoteFaeTableCommand(uint16_t connHandle,
                                                 BleCsHciCommand* outCommand);
  static bool parseHciReadRemoteFaeTableCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsFaeTable* outTable);
  static bool buildHciWriteCachedRemoteFaeTableCommand(
      uint16_t connHandle,
      const int8_t faeTable[kBleCsFaeTableValueCount],
      BleCsHciCommand* outCommand);

  // ─── Zephyr Parity: Cached Capabilities HCI ────────────────
  static bool buildHciWriteCachedRemoteSupportedCapabilitiesCommand(
      uint16_t connHandle,
      const BleCsControllerCapabilities& capabilities,
      BleCsHciCommand* outCommand);
  static bool buildHciWriteCachedRemoteSupportedCapabilitiesV2Command(
      uint16_t connHandle,
      const BleCsControllerCapabilities& capabilities,
      BleCsHciCommand* outCommand);

  BleCsDfeCaptureInfo lastDfeCaptureInfo() const;
  bool copyLastDfePacket(uint8_t* outPacket,
                         size_t maxLen,
                         size_t* outLen) const;

 private:
  enum class PacketType : uint8_t {
    kControl = 0x43U,
    kProbe = 0x50U,
    kReport = 0x52U,
  };

  struct RxFrame {
    bool valid = false;
    PacketType type = PacketType::kControl;
    uint8_t sequence = 0;
    uint8_t channelIndex = 0;
    uint8_t flags = 0;
    int8_t rssiDbm = 0;
    uint8_t extra[24] = {0};
    uint8_t extraLen = 0;
  };

  bool configureBle2MCommon();
  bool setLogicalChannel(uint8_t channelIndex);
  void configureRtt(bool enabled, bool reflectorRole);
  void prepareAuxDataCapture();
  void configureTxToneExtension();
  void configureRxToneCapture();
  void clearEvents();
  bool sendFrame(uint8_t logicalChannel,
                 PacketType type,
                 uint8_t sequence,
                 uint8_t channelIndex,
                 uint8_t flags,
                 const uint8_t* extra,
                 uint8_t extraLen,
                 bool enableRtt,
                 bool rttReflectorRole);
  bool receiveFrame(uint8_t logicalChannel,
                    uint32_t listenWindowUs,
                    bool captureTone,
                    bool captureRtt,
                    bool rttReflectorRole,
                    RxFrame* outFrame,
                    BleCsToneSample* outTone,
                    BleCsRttSample* outRtt);
  bool decodeFrame(const uint8_t* packet,
                   size_t packetLen,
                   int8_t rssiDbm,
                   RxFrame* outFrame) const;
  void encodeReportExtra(const BleCsToneSample& tone, uint8_t* outExtra) const;
  void decodeReportExtra(const uint8_t* extra,
                         uint8_t extraLen,
                         BleCsToneSample* outTone) const;
  void encodeRttExtra(const BleCsRttSample& rtt, uint8_t* outExtra) const;
  void decodeRttExtra(const uint8_t* extra,
                      uint8_t extraLen,
                      BleCsRttSample* outRtt) const;
  void captureAuxDataRtt(BleCsRttSample* outRtt);
  void resetDfeCaptureState();
  void updateDfeCaptureState();
  void parseRttRaw(BleCsRttSample* outRtt) const;
  uint8_t makeCteInfo() const;

  NRF_RADIO_Type* radio_;
  PowerManager power_;
  BleCsConfig config_;
  bool initialized_;
  alignas(4) uint8_t txPacket_[3U + 48U];
  alignas(4) uint8_t rxPacket_[3U + 48U];
  alignas(4) uint8_t dfePacket_[512U];
  alignas(4) uint32_t auxDataWords_[4];
  uint16_t lastDfePacketAmountBytes_;
  uint16_t lastDfePacketCurrentAmountBytes_;
  bool lastDfePacketAllZero_;
};

class BleCsSubeventResultReassembler {
 public:
  BleCsSubeventResultReassembler();

  void reset();
  bool active() const;

  bool consumeInitialEvent(const uint8_t* eventData,
                           size_t eventLen,
                           BleCsSubeventResult* outResult);
  bool consumeContinuationEvent(const uint8_t* eventData,
                                size_t eventLen,
                                BleCsSubeventResult* outResult);

 private:
  static constexpr size_t kMaxStepDataBytes = kBleCsMaxControllerStepDataBytes;

  bool appendStepData(const uint8_t* data, size_t len);
  void fillOutput(bool complete,
                  bool continuation,
                  BleCsSubeventResult* outResult) const;

  BleCsSubeventResultHeader header_;
  uint8_t stepData_[kMaxStepDataBytes];
  uint16_t stepDataLen_;
  bool active_;
};

class BleCsControllerWorkflow {
 public:
  BleCsControllerWorkflow();

  void reset();
  bool begin(uint16_t connHandle, const BleCsControllerWorkflowConfig& config);

  bool active() const;
  bool ready() const;
  bool failed() const;

  BleCsControllerWorkflowPhase phase() const;
  const BleCsControllerWorkflowState& state() const;
  const BleCsControllerWorkflowConfig& config() const;

  bool buildNextCommand(BleCsHciCommand* outCommand);
  bool acknowledgeCommandStatus(uint16_t opcode, uint8_t status);
  bool consumeEvent(uint8_t subeventCode, const uint8_t* eventData, size_t eventLen);
  bool consumeHciEventPacket(const uint8_t* packet, size_t packetLen);
  void reconcileReadyShadowState(uint8_t selectedConfigId,
                                 bool sessionOpen,
                                 bool configCreated,
                                 bool securityEnabled,
                                 bool procedureParametersApplied,
                                 bool procedureEnabled);

  static const char* phaseName(BleCsControllerWorkflowPhase phase);

 private:
  static bool validateConfigAgainstCapabilities(
      const BleCsControllerWorkflowConfig& config,
      const BleCsControllerCapabilities& capabilities);
  bool acknowledgeReadyCommandStatus(uint16_t opcode, uint8_t status);
  bool consumeReadyEvent(uint8_t subeventCode, const uint8_t* eventData, size_t eventLen);
  void fail(uint8_t status);

  BleCsControllerWorkflowConfig config_;
  BleCsControllerWorkflowState state_;
};

class BleHciPacketStreamDecoder {
 public:
  BleHciPacketStreamDecoder();

  void reset();
  void setAcceptedPacketTypes(uint32_t acceptedTypes);
  uint32_t acceptedPacketTypes() const;
  uint32_t deliveredPacketCount() const;
  uint32_t ignoredPacketCount() const;
  uint32_t ignoredByteCount() const;
  bool pushBytes(const uint8_t* data,
                 size_t len,
                 bool (*onPacket)(const uint8_t* packet, size_t packetLen, void* userData),
                 void* userData);

